# Cable Type Get Cable Type Ids Method

Source: https://www.revitapidocs.com/2026/aa1891c3-3f36-e4f2-692f-cd0c8b15eef3.htm

---

| Cable Type Get Cable Type Ids Method |
| --- |

Gets all the Cable Types in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetCableTypeIds(
	Document document
)
```

```
Public Shared Function GetCableTypeIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetCableTypeIds(
	Document^ document
)
```

```
static member GetCableTypeIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Cable Type ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace